app/controllers/messages_controller.rb

  def create
    @message = Message.new(message_params)
    @messages = Message.all

    respond_to do |format|
      if @message.save
---
SELECT "messages".* FROM "messages"
INSERT INTO "messages" ("title", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "This app is awesome!"], ["message", "Really helpfull!!"], ["created_at", "2015-06-20 17:07:04.197340"], ["updated_at", "2015-06-20 17:07:04.197340"]]